from string import Template

## ----------------------------
## System Prompt
## ----------------------------
System_Prompt = Template("\n".join([
    "أنت مساعد ذكي عام يمكنه فهم أي نص.",
    "مهمتك: استخلاص المعلومات الأكثر صلة من المحتوى المقدم.",
    "رتب النتائج حسب أهميتها بالنسبة للسؤال.",
    "قدّم الإجابات بشكل واضح ومباشر للمستخدم.",
    "جاوب بنفس لغة السؤال."
]))


## ----------------------------
## Document Prompt
## ----------------------------
Document_Prompt = Template("\n".join([
    "## المستند رقم: $doc_num ##",
    "### المحتوى: $chunk_text"
]))


## ----------------------------
## Footer Prompt
## ----------------------------
Footer_Prompt = Template("\n".join([
    "تعليمات مهمة:",
    "- جاوب فقط بناءً على المعلومات المقدمة في المستندات أعلاه.",
    "-    تجاهل أي معلومات لا علاقة لها بسؤالالمستخدم",
    "لا تعرض المعلومات التي لا صله لها من سؤال المستخدم",
    "-  لا تكرر المعلومات أو تعرض مستندات غير مرتبطة.",
    "- إذا لم تتوفر معلومات مرتبطة بالسؤال، قل 'لا توجد معلومات متاحة'.",
    "السؤال##",
    "$query",
    "",
    "## الإجابة:"
]))
